{
    "i_am": "I’m",
    "about_me": "Crafting seamless and intuitive user experiences with React and TypeScript.",
    "lang": "languages.",
    "en": "english",
    "it": "italian",
    "ja": "japanese",
    "native": "native",
    "good": "good",
    "very_bg": "very beginner",
    "theme": "theme",
    "more": "more about me",
    "to_projects": "projects",
    "contact": "contact me",
    "g_day": "Good morning",
    "g_noon": "Good afternoon",
    "g_night": "Good evening",
    "mail_obj": "from /salfromvenice.github.io/Salvatore-Strangio/",
    "about": "about me.",
    "contact_me": "contact me.",
    "mail_me": "mail me",
    "ve_it": "Venice, Italy",
    "more_about_1": "I am a frontend web developer based in Venice, Italy. I craft engaging and user-friendly digital experiences. At BIP, I use React and TypeScript to develop scalable solutions, transforming complex ideas into seamless interfaces while continuously refining user interactions.",
    "more_about_2": "My journey into tech began with an intensive 9-week coding bootcamp, which sparked my transition from the public transport sector to a career in development.",
    "more_about_3": "Beyond coding, I enjoy traveling, gaming, and sports. I’m currently exploring Japanese culture and language. I thrive in dynamic roles where I can apply my skills, embrace new challenges, and contribute to impactful projects.",
    "projects": "projects.",
    "app_1_title": "<Sal TO_DO />",
    "app_1_desc": "A task management web app with a Ruby on Rails backend that provides a REST API, including authentication, and is hosted on Railway. Continuous Integration (CI) automates the deployment process with each push to the main branch. The frontend is developed using React, TypeScript, and Tailwind CSS, incorporating Adobe React Aria components for enhanced accessibility. It is deployed on Netlify and features a UX design optimized for mobile devices. CI also ensures automatic deployment updates for each push to the main branch.",
    "app_2_title": "Fake Login Page",
    "app_2_subtitle": "Cybersecurity Awareness Project",
    "app_2_desc": "A fake login page developed as a tool for raising awareness about cybersecurity, designed to educate users and employees on the risks of phishing. The project is built as a single standalone HTML file with embedded CSS and JavaScript, realistically simulating a login interface. The page is hosted on GitHub Pages, making it easily accessible for demonstrations in controlled environments and training sessions.",
    "app_3_title": "DevStats",
    "app_3_desc": "DevStats is a monolithic web application built with Ruby on Rails, Vite, TypeScript, and React, and deployed on Render. The app allows users to search for a GitHub account by username and uses GitHub’s GraphQL API to fetch data about the user’s public repositories. Once the data is retrieved, DevStats analyzes the programming languages used and displays an interactive chart showing the distribution of languages across repositories. This makes it easy to understand which languages a developer uses most, through a fast, modern, and fully responsive interface."
}
